/********************** Задача 01 ******************************
 * Что выведет консоль.
 */

// let i = 5;
// i = i++;
// console.log(i);// 5

/**                     Пояснения к задаче 01
 *
 ***************************************************************/




/********************** Задача 02 ******************************
 * Что выведет консоль.
 *
// /**
//  * Что выведет консоль.
//  * 6
//  * 3
//  * 4
//  * undefined
//  * NaN
//  */

// let a = new Array(1,2);
// let b = new Array(3);
// console.log(a[0] + b[0]);  //NaN
//

/**                     Пояснения к задаче 02
 *
 ***************************************************************/




/********************** Задача 03 ******************************
 * Что выведет консоль.
 * "ello World"
 * "hello world!"
 * "Hello World!"
 * "ello world!"
 */

// let x = "Hello World!";
//  x[1] = "h";
//  x[7] = "w";
// console.log(x.slice('1'));//"ello World!"

/**                     Пояснения к задаче 03
 * В СТРОГОМ РЕЖИМЕ ЗАДАЧА ВЫДАСТ ОШИБКУ.НЕ В СТРОГОМ СРАБОТАЕТ.
 ***************************************************************/





/********************** Задача 04 *******************************
 * Что выведет консоль.
 * "false true true false"
 * "false true false true"
 * "false true true true"
 * "true false true false"
 * "true false false false"
 */

// let a = [], b = [];
// console.log((a == b) + ' ' + (a == !b) + ' ' + (!a == b) + ' ' + (!a ==!b));// false true true true

/**                     Пояснения к задаче 04
 * При приведении к булеву  типу происходит следующее.
 * console.log(Boolean([])); //true
 * console.log(Boolean(![])); // false
 * console.log(Boolean(![]==[])); //true
 * К булеву типу 0,NaN,null,undefined,false пустая строка приводятся к false. Остальные true.
 ***************************************************************/


/********************** Задача 05 *******************************
 * Что выведет консоль.
 * 11
 * 10
 * 9
 * 12
 * "38"
 * 39
 */
// let a = "3";
// let b = 8;
// let c = a+++b;
// console.log(c);//11
/**                     Пояснения к задаче 05
 * Равносильно следующей записи.
 * c = a++ +b
 * c = a++ -b
 * Оператор ++ выполняется первым и тем самым приводит строковый тип к числу а потом происходит сложение
 ***************************************************************/


/********************** Задача 06 *******************************
 * Что выведет консоль.
 *  0
 *  1
 *  2
 *  3
 */

// console.log(0 || 1 && 2 || 3); // вернет 2


/**                     Пояснения к задаче 06
 * В js есть три логических оператора ||(или),&&(и), и !(не)
 *
 * ||(или)
 * (true || true)    //true;
 * (false || true)   //true;
 * (true || false)   //true;
 * (false || false)  //false;
 *
 * result = value1 || value2 || value 3
 * Что тут происходит? конвертируется в логическое. Если результат true останавливается и возвращает значение.
 * Если все ложные возвращает  последний из них.
 *
 * &&(и)
 * rusult = a && b;
 * true && true   //true
 * false && true  //false
 * true && false  //false
 * false && false //false
 *
 * result = value1 && value2 && value 3
 * Что тут происходит? конвертируется в логическое. Если результат false останавливается и возвращает значение.
 * Если все истинные возвращает false последний из них.
 *
 * Наше выражение можно привести к следующим действиям.
 *
 * Boolean(0) || Boolean(1) = false || true //вернет 1
 * Boolean(1) && Boolean(2) = true && true  //вернет 2
 * Boolean(2) || Boolean(3) = true && true  //вернет 2
 *
 ***************************************************************/

/********************** Задача 07 *******************************
 * Что выведет консоль.
 */
 // const strint = "String";
 // age = 18;
 //
 // console.log(delete strint); //false
 // console.log(delete age); //true
/**                     Пояснения к задаче 07
 * В СТРОГОМ РЕЖИМЕ ЗАДАЧА ВЫДАСТ ОШИБКУ.НЕ В СТРОГОМ СРАБОТАЕТ.
 *
 *
 ***************************************************************/


/********************** Задача 08 *******************************
 * Что выведет консоль.
 * 1 1
 * 1 2
 * 2 1
 * NaN NaN
 * Undefined 1
 * Undefined Undefined
 */

// let a;
// a = parseInt(++a);
//
// console.log(++a);// NaN
// console.log(a--);// NaN

/**                     Пояснения к задаче 08
 * Функция parseInt преобразует первый аргумент в число по указанному основанию,
 * а если это невозможно - возвращает NaN.  parseInt(string[, radix])
 *
 * То есть string это строка в той или иной системе счисления а radix это система счисления
 * parseInt(" FF", 16) //15
 * parseInt("17", 8) //15
 * parseInt(021, 8) //15
 *
  Так как значение  переменной a, не заданно. то оно равно undefined.
  соответственно parseInt(++a) просто не сможет преобразовать undefined и вернет NaN.
 ***************************************************************/

/********************** Задача 09 *******************************
 * Что выведет консоль.
 * [1,2,3,4,5]
 * [1,3,5]
 * [2,4]
 * [2,3,4,5,6]
 * [2,4,6,8,10]
 */

//  let arr =[1,2,3,4,5];
//  let result =arr.filter(function(el){
//      return el % 2;
// })
// console.log(result); //[1,3,5]

/**                     Пояснения к задаче 09
 *
 ***************************************************************/

/********************** Задача 10 *******************************
 * Что выведет консоль.
 * 12,12
 * 12,36
 * 36,36
 * 36,12
 * {12,36}
 * TypeError
 */
let b= {};
let c;
b.b =12;   //console.log(b, c);
c = b;     //console.log(b, c);
c.b =36;   //console.log(b, c);
console.log(b.b); //36
console.log(c.b); //36


/**                     Пояснения к задаче 10
 *
 ***************************************************************/


/********************** Задача 11 *******************************
 * Что выведет консоль.
 */



/**                     Пояснения к задаче 11
 *
 ***************************************************************/





/********************** Задача 07 *******************************
 * Что выведет консоль.
 */

/**                     Пояснения к задаче 07
 *
 ***************************************************************/









