/********************** Задача 01 ******************************
 * Что выведет консоль.
 */

// let i = 5;
// i = i++;
// console.log(i);// 5

/**                     Пояснения к задаче 01
 *
 ***************************************************************/




/********************** Задача 02 ******************************
 * Что выведет консоль.
 *
// /**
//  * Что выведет консоль.
//  * 6
//  * 3
//  * 4
//  * undefined
//  * NaN
//  */

// let a = new Array(1,2);
// let b = new Array(3);
// console.log(a[0] + b[0]);  //NaN
//

/**                     Пояснения к задаче 02
 *
 ***************************************************************/




/********************** Задача 03 ******************************
 * Что выведет консоль.
 * "ello World"
 * "hello world!"
 * "Hello World!"
 * "ello world!"
 */

// let x = "Hello World!";
//  x[1] = "h";
//  x[7] = "w";
// console.log(x.slice('5'));

/**                     Пояснения к задаче 03
 *
 ***************************************************************/





/********************** Задача 04 *******************************
 * Что выведет консоль.
 * "false true true false"
 * "false true false true"
 * "false true true true"
 * "true false true false"
 * "true false false false"
 */

// let a = [], b = [];
// console.log((a == b) + ' ' + (a == !b) + ' ' + (!a == b) + ' ' + (!a ==!b));// false true true true

/**                     Пояснения к задаче 04
 * При приведении к булеву  типу происходит следующее.
 * console.log(Boolean([])); //true
 * console.log(Boolean(![])); // false
 * console.log(Boolean(![]==[])); //true
 * К булеву типу 0,NaN,null,undefined,false пустая строка приводятся к false. Остальные true.
 ***************************************************************/


/********************** Задача 05 *******************************
 * Что выведет консоль.
 * 11
 * 10
 * 9
 * 12
 * "38"
 * 39
 */
let a = "3";
let b = 8;
let c = a+++b;
console.log(c);//11
/**                     Пояснения к задаче 05
 * c = a++ +b
 * c = a++ -b
 * Оператор ++ выполняется первым и тем самым приводит строковый тип к числу а потом происходит сложение
 ***************************************************************/











